MusicApp/app/controllers/bands_controller.rb

INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Pots and Pans"], ["created_at", "2018-10-18 19:38:57.904703"], ["updated_at", "2018-10-18 19:38:57.904703"]]
---
  def create
    @band = Band.new(band_params)

    if @band.save

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def update
    @band = Band.find(params[:id])

SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "bands" WHERE "bands"."id" = $1  [["id", 2]]
---
  def destroy
    @band = Band.find(params[:id])

    if @band.destroy