MusicApp/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token") VALUES ($1, $2, $3) RETURNING "id"  [["email", "william@gmail.com"], ["password_digest", "$2a$10$GFXFdVxEFmXuzgbGuG4ybeDiW7OzHbarPWDGLllyvTB7cRg/V3Nay"], ["session_token", "K58E6YEe827_6VimPnDn1Q"]]
---
  def create
    @user = User.new(user_params)

    if @user.save